Revit 2024 API
LinePatternElement.GetLinePattern Method
 Gets the LinePattern associated to this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public LinePattern GetLinePattern()
Visual Basic
Public Function GetLinePattern As LinePattern
Visual C++
public:
LinePattern^ GetLinePattern()
Return Value
 A copy of LinePattern object.
See Also
LinePatternElement Class
GetLinePattern Overload
Autodesk.Revit.DB Namespace